Revit 2027 API
ItemFactoryBase Properties
The ItemFactoryBase type exposes the following members.
Properties
Name | Description
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Top
See Also
Reference
ItemFactoryBase Class
Autodesk.Revit.Creation Namespace